In [56]:
import numpy as np
import pandas as pd

In [57]:
df = pd.DataFrame({
    'A': [1, 2, 3, 4, 5],
    'B': [10, 20, 30, 40, 50],
    'C': [100, 200, 300, 400, 500]
})

df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

***DataFrames Basic Operations***

In [58]:
df.shape

(5, 3)

In [59]:
df.columns

Index(['A', 'B', 'C'], dtype='object')

In [60]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      int64
 2   C       5 non-null      int64
dtypes: int64(3)
memory usage: 252.0 bytes

In [61]:
df.describe()

              A          B           C
count  5.000000   5.000000    5.000000
mean   3.000000  30.000000  300.000000
std    1.581139  15.811388  158.113883
min    1.000000  10.000000  100.000000
25%    2.000000  20.000000  200.000000
50%    3.000000  30.000000  300.000000
75%    4.000000  40.000000  400.000000
max    5.000000  50.000000  500.000000

In [62]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [63]:
df['A'] + 10

0    11
1    12
2    13
3    14
4    15
Name: A, dtype: int64

***DataFrames Applying Functions***

In [64]:
df

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400
4  5  50  500

In [65]:
def square(x):
    return x**2

In [66]:
#creating a new column{'D'} to store this operation on column{'B'}:
df['D'] = df['B'].apply(square)
df['D']

0     100
1     400
2     900
3    1600
4    2500
Name: D, dtype: int64

In [67]:
df

   A   B    C     D
0  1  10  100   100
1  2  20  200   400
2  3  30  300   900
3  4  40  400  1600
4  5  50  500  2500

In [68]:
#through lambda function:
df['E'] = df['C'].apply(lambda x: x**2)
df['E']

0     10000
1     40000
2     90000
3    160000
4    250000
Name: E, dtype: int64

In [ ]:
df

   A   B    C     D       E
0  1  10  100   100   10000
1  2  20  200   400   40000
2  3  30  300   900   90000
3  4  40  400  1600  160000
4  5  50  500  2500  250000

: